In [1]:
import pandas as pd

In [2]:
my_data = {
    'cars' : ['Toyota', 'Honda', 'Ford', 'BMW'],
    'price' : [24000, 22000, 26000, 35000]
}

# creat a DataFrame
df_cars = pd.DataFrame(my_data)

In [3]:
df_cars.head()

     cars  price
0  Toyota  24000
1   Honda  22000
2    Ford  26000
3     BMW  35000

In [6]:
a = ['Honda', 'Toyota', 'Ford', 'BMW']
sr = pd.Series(a)
print(sr)

0     Honda
1    Toyota
2      Ford
3       BMW
dtype: object

In [5]:
print(df_cars.loc[1])

cars     Honda
price    22000
Name: 1, dtype: object

In [7]:
print(df_cars.loc[[1,3]])

    cars  price
1  Honda  22000
3    BMW  35000

In [8]:
print(sr[1])

Toyota

In [ ]:
my_data = {
    'cars' : ['Toyota', 'Honda', 'Ford', 'BMW'],
    'price' : [24000, 22000, 26000, 35000]
}

# change index
df_cars = pd.DataFrame(my_data, index=['CAR01', 'CAR02', 'CAR03', 'CAR04'])
df_cars.head()

         cars  price
CAR01  Toyota  24000
CAR02   Honda  22000
CAR03    Ford  26000
CAR04     BMW  35000

In [14]:
print(df_cars.loc['CAR03'])
print(df_cars.loc[['CAR03','CAR01']])

cars      Ford
price    26000
Name: CAR03, dtype: object
         cars  price
CAR03    Ford  26000
CAR01  Toyota  24000

In [27]:
df_training = pd.read_csv('datab10.csv')
df_training.head()

   Duration  Pulse  Maxpulse  Calories
0      60.0  110.0     130.0     409.1
1      60.0  117.0     145.0     479.0
2      60.0  103.0     135.0     340.0
3      45.0  109.0     175.0     282.4
4      45.0  117.0     148.0     406.0

In [28]:
print(list(df_training.columns))

['Duration', 'Pulse', 'Maxpulse', 'Calories']

In [29]:
print(df_training.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 172 entries, 0 to 171
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  170 non-null    float64
 1   Pulse     171 non-null    float64
 2   Maxpulse  171 non-null    float64
 3   Calories  167 non-null    float64
dtypes: float64(4)
memory usage: 5.5 KB
None

In [30]:
print(df_training.describe())

         Duration       Pulse    Maxpulse     Calories
count  170.000000  171.000000  171.000000   167.000000
mean    64.088235  107.497076  134.280702   375.304192
std     42.103260   14.438663   16.431413   264.009282
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   252.150000
50%     60.000000  105.000000  131.000000   320.400000
75%     60.000000  111.000000  143.000000   385.800000
max    300.000000  159.000000  184.000000  1860.400000

In [31]:
print(df_training.isnull().sum())

Duration    2
Pulse       1
Maxpulse    1
Calories    5
dtype: int64

In [32]:
df_training_cleaned = df_training.dropna()
print(df_training_cleaned.isnull().sum())

Duration    0
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [33]:
print(len(df_training), len(df_training_cleaned))

172 163

In [34]:
# drop only NA rows for calories column
df_training_cleaned = df_training.dropna(subset=['Calories'])
print(df_training_cleaned.isnull().sum())
print(len(df_training), len(df_training_cleaned))

Duration    2
Pulse       1
Maxpulse    1
Calories    0
dtype: int64
172 167

In [39]:
#replace null value with 0
df_training = pd.read_csv('datab10.csv')
df_training_cleaned = df_training.fillna(0, inplace=False)
print(df_training_cleaned.isnull().sum())

Duration    0
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [40]:
print(df_training.isnull().sum())

Duration    2
Pulse       1
Maxpulse    1
Calories    5
dtype: int64

In [41]:
df_training.describe()

         Duration       Pulse    Maxpulse     Calories
count  170.000000  171.000000  171.000000   167.000000
mean    64.088235  107.497076  134.280702   375.304192
std     42.103260   14.438663   16.431413   264.009282
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   252.150000
50%     60.000000  105.000000  131.000000   320.400000
75%     60.000000  111.000000  143.000000   385.800000
max    300.000000  159.000000  184.000000  1860.400000

In [42]:
duration_mean =  df_training['Duration'].mean()
print('Mean Duration:', duration_mean)

Mean Duration: 64.08823529411765

In [ ]:
#replace null value with mean value
df_training_cleaned = df_training.copy()
df_training_cleaned['Duration'].fillna(duration_mean, inplace=True)
print(df_training_cleaned.isnull().sum())

Duration    0
Pulse       1
Maxpulse    1
Calories    5
dtype: int64

In [48]:
print(df_training_cleaned['Duration'].mean())

64.08823529411764

In [49]:
min_calories = df_training['Calories'].min()
print(min_calories)

50.3

In [ ]:
# replace null value with min value
df_training_cleaned = df_training.copy()
df_training_cleaned.fillna({'Calories': min_calories}, inplace=True)
print(df_training_cleaned.isnull().sum())

Duration    2
Pulse       1
Maxpulse    1
Calories    0
dtype: int64

In [55]:
print(df_training_cleaned['Calories'].mean())

365.8563953488372

In [57]:
df_department = pd.DataFrame({
    'Department': ['Sales', 'HR', 'Sales', 'HR', 'Sales'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Salary': [70000, 60000, 72000, 58000, 71000]
})

In [58]:
df_department.head()

  Department Employee  Salary
0      Sales    Alice   70000
1         HR      Bob   60000
2      Sales  Charlie   72000
3         HR    David   58000
4      Sales      Eva   71000

In [59]:
mean_salary = df_department.groupby('Department')['Salary'].mean()
print(mean_salary)

Department
HR       59000.0
Sales    71000.0
Name: Salary, dtype: float64

In [60]:
employee_count = df_department.groupby('Department')['Employee'].count()
print(employee_count)

Department
HR       2
Sales    3
Name: Employee, dtype: int64

In [61]:
min_salary = df_department.groupby('Department')['Salary'].min()
print(min_salary)

Department
HR       58000
Sales    70000
Name: Salary, dtype: int64

In [62]:
df_training = pd.read_csv('datab10.csv')
df_training.head()

   Duration  Pulse  Maxpulse  Calories
0      60.0  110.0     130.0     409.1
1      60.0  117.0     145.0     479.0
2      60.0  103.0     135.0     340.0
3      45.0  109.0     175.0     282.4
4      45.0  117.0     148.0     406.0

In [63]:
print(df_training['Duration'].unique())

[ 60.  45.  nan  80.  30.  20. 210. 160. 180. 150. 300.  90. 120. 270.
  15.  25.  75.]

In [69]:
df_training_cleaned = df_training.fillna({
    'Duration': df_training['Duration'].mean(),
    'Calories': df_training['Calories'].mean(),
    'Pulse': df_training['Pulse'].mean(),
    'Maxpulse': df_training['Maxpulse'].mean()
})

In [72]:
print(df_training_cleaned.groupby('Duration')['Calories'].mean())

Duration
15.000000       87.350000
20.000000      151.600000
25.000000      244.200000
30.000000      191.926667
45.000000      279.068811
60.000000      341.062657
64.088235      288.550000
75.000000      323.733333
80.000000      643.100000
90.000000      541.800000
120.000000     666.833333
150.000000     939.400000
160.000000     943.700000
180.000000     733.600000
210.000000    1618.200000
270.000000    1729.000000
300.000000    1500.200000
Name: Calories, dtype: float64

In [70]:
my_data = {
    'cars' : ['Toyota', 'Honda', 'Ford', 'BMW'],
    'price' : [24000, 22000, 26000, 35000]
}

# change index
df_cars = pd.DataFrame(my_data, index=['CAR01', 'CAR02', 'CAR03', 'CAR04'])
df_cars.head()

         cars  price
CAR01  Toyota  24000
CAR02   Honda  22000
CAR03    Ford  26000
CAR04     BMW  35000

In [71]:
df_cars['used'] = [True, False, True, False]
df_cars.head()

         cars  price   used
CAR01  Toyota  24000   True
CAR02   Honda  22000  False
CAR03    Ford  26000   True
CAR04     BMW  35000  False

In [79]:
def strength(duration):
    return 'Strong' if duration >= 60 else 'Weak'

In [81]:
df_training_cleaned['Strength'] = df_training_cleaned['Duration'].apply(strength)
df_training_cleaned.head()

   Duration  Pulse  Maxpulse  Calories Strength
0      60.0  110.0     130.0     409.1   Strong
1      60.0  117.0     145.0     479.0   Strong
2      60.0  103.0     135.0     340.0   Strong
3      45.0  109.0     175.0     282.4     Weak
4      45.0  117.0     148.0     406.0     Weak

In [ ]:
#replace func with lambda
df_training_cleaned['Strength'] = df_training_cleaned['Duration'].apply(lambda duration: 'Strong' if duration >= 60 else 'Weak')
df_training_cleaned.head()

   Duration  Pulse  Maxpulse  Calories Strength
0      60.0  110.0     130.0     409.1   Strong
1      60.0  117.0     145.0     479.0   Strong
2      60.0  103.0     135.0     340.0   Strong
3      45.0  109.0     175.0     282.4     Weak
4      45.0  117.0     148.0     406.0     Weak